EXPERIMENT 18: CONVOLUTIONAL NEURAL NETWORK

NO DROPOUT OR KERNEL REGULARIZATION BETWEEN CONVOLUTIONAL LAYERS
Parameters
	epochs:			10
	batch_size:		32
	depth_conv:		5
	depth_dense:	2
	filters:		512
	kernel_size:	5
	reg:			l2(5e-1)
	activation:		relu
	batch_norm:		True
	dropout:		0.4
	class_weight:	{0: 1.1560693641618498, 1: 7.407407407407407}
	look_back:		5000
	stride:			10
	predicted_timestamps:	1
	target_steps_ahead:		5000
	subsampling_factor:		2

Model
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_1 (Conv1D)            (None, 4996, 512)         230912    
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 2498, 512)         0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 2494, 512)         1311232   
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, 1247, 512)         0         
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 1243, 512)         1311232   
_________________________________________________________________
max_pooling1d_3 (MaxPooling1 (None, 621, 512)          0         
_________________________________________________________________
conv1d_4 (Conv1D)            (None, 617, 512)          1311232   
_________________________________________________________________
max_pooling1d_4 (MaxPooling1 (None, 308, 512)          0         
_________________________________________________________________
conv1d_5 (Conv1D)            (None, 304, 256)          655616    
_________________________________________________________________
max_pooling1d_5 (MaxPooling1 (None, 152, 256)          0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 38912)             0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 38912)             155648    
_________________________________________________________________
dropout_1 (Dropout)          (None, 38912)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               9961728   
_________________________________________________________________
batch_normalization_2 (Batch (None, 256)               1024      
_________________________________________________________________
dropout_2 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 257       
=================================================================
Total params: 14,938,881
Trainable params: 14,860,545
Non-trainable params: 78,336
_________________________________________________________________

Data shape
	X_train shape:	(8100, 5000, 90)
	y_train shape:	(8100,)
	X_test shape: 	(9001, 5000, 90)
	y_test shape: 	(9001,)

Results on train set
	Loss:		7.137478418997956
	Accuracy:	0.3333333333333333
	Roc_auc:	0.9998988683127572

Results on test set
	Loss_keras:	10.050707090140687
	Loss:		9.298118979638534
	Accuracy:	0.16664815020553272
	Roc_auc:	0.5878459316535574
