EXPERIMENT 5: CONVOLUTIONAL NEURAL NETWORK

NO DROPOUT OR KERNEL REGULARIZATION BETWEEN CONVOLUTIONAL LAYERS
Parameters
	epochs:			10
	batch_size:		32
	depth_conv:		5
	depth_dense:	2
	filters:		512
	kernel_size:	5
	reg:			l2(5e-1)
	activation:		relu
	batch_norm:		True
	dropout:		0.4
	class_weight:	{0: 1.1560693641618498, 1: 7.407407407407407}
	look_back:		2000
	stride:			10
	predicted_timestamps:	1
	target_steps_ahead:		2000
	subsampling_factor:		2

Model
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_1 (Conv1D)            (None, 1996, 512)         230912    
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 998, 512)          0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 994, 512)          1311232   
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, 497, 512)          0         
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 493, 512)          1311232   
_________________________________________________________________
max_pooling1d_3 (MaxPooling1 (None, 246, 512)          0         
_________________________________________________________________
conv1d_4 (Conv1D)            (None, 242, 512)          1311232   
_________________________________________________________________
max_pooling1d_4 (MaxPooling1 (None, 121, 512)          0         
_________________________________________________________________
conv1d_5 (Conv1D)            (None, 117, 256)          655616    
_________________________________________________________________
max_pooling1d_5 (MaxPooling1 (None, 58, 256)           0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 14848)             0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 14848)             59392     
_________________________________________________________________
dropout_1 (Dropout)          (None, 14848)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               3801344   
_________________________________________________________________
batch_normalization_2 (Batch (None, 256)               1024      
_________________________________________________________________
dropout_2 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 257       
=================================================================
Total params: 8,682,241
Trainable params: 8,652,033
Non-trainable params: 30,208
_________________________________________________________________

Data shape
	X_train shape:	(8100, 2000, 90)
	y_train shape:	(8100,)
	X_test shape: 	(9601, 2000, 90)
	y_test shape: 	(9601,)

Results on train set
	Loss:		0.2392536499181376
	Accuracy:	0.9271604938271605
	Roc_auc:	0.9994707133058985

Results on test set
	Loss_keras:	1.5124545992072604
	Loss:		0.7562853825448794
	Accuracy:	0.7208624101656077
	Roc_auc:	0.9287922067234499
