EXPERIMENT 28: CONVOLUTIONAL NEURAL NETWORK

Parameters
	epochs:			10
	batch_size:		64
	depth_conv:		5
	depth_dense:	2
	filters:		256
	kernel_size:	5
	reg:			l2(5e-1)
	activation:		relu
	batch_norm:		True
	dropout:		0.4
	class_weight:	{0: 1.1560693641618498, 1: 7.407407407407407}
	look_back:		1000
	stride:			1
	predicted_timestamps:	1
	target_steps_ahead:		1000
	subsampling_factor:		2

Model
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_1 (Conv1D)            (None, 996, 256)          115456    
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 498, 256)          0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 498, 256)          1024      
_________________________________________________________________
dropout_1 (Dropout)          (None, 498, 256)          0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 494, 256)          327936    
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, 247, 256)          0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 247, 256)          1024      
_________________________________________________________________
dropout_2 (Dropout)          (None, 247, 256)          0         
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 243, 256)          327936    
_________________________________________________________________
max_pooling1d_3 (MaxPooling1 (None, 121, 256)          0         
_________________________________________________________________
batch_normalization_3 (Batch (None, 121, 256)          1024      
_________________________________________________________________
dropout_3 (Dropout)          (None, 121, 256)          0         
_________________________________________________________________
conv1d_4 (Conv1D)            (None, 117, 256)          327936    
_________________________________________________________________
max_pooling1d_4 (MaxPooling1 (None, 58, 256)           0         
_________________________________________________________________
batch_normalization_4 (Batch (None, 58, 256)           1024      
_________________________________________________________________
dropout_4 (Dropout)          (None, 58, 256)           0         
_________________________________________________________________
conv1d_5 (Conv1D)            (None, 54, 128)           163968    
_________________________________________________________________
max_pooling1d_5 (MaxPooling1 (None, 27, 128)           0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 3456)              0         
_________________________________________________________________
batch_normalization_5 (Batch (None, 3456)              13824     
_________________________________________________________________
dropout_5 (Dropout)          (None, 3456)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               884992    
_________________________________________________________________
batch_normalization_6 (Batch (None, 256)               1024      
_________________________________________________________________
dropout_6 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 257       
=================================================================
Total params: 2,167,425
Trainable params: 2,157,953
Non-trainable params: 9,472
_________________________________________________________________

Data shape
	X_train shape:	(81000, 1000, 90)
	y_train shape:	(81000,)
	X_test shape: 	(98001, 1000, 90)
	y_test shape: 	(98001,)

Results on train set
	Loss:		0.2007498813735114
	Accuracy:	0.9981851851851852
	Roc_auc:	0.9999844718792866

Results on test set
	Loss_keras:	0.6166108288874041
	Loss:		0.31432205179229894
	Accuracy:	0.910215201885695
	Roc_auc:	0.9333076830399634
